OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/combustion/PDRFoam/pipeLattice/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p       100000
    volScalarFieldValue T       287
    volScalarFieldValue Tu      287
    volScalarFieldValue ft      0
);


regions
(
    boxToCell
    {
        box    (0 0 0) (4.0 4.0 2.0);

        fieldValues
        (
            volScalarFieldValue ft 0.0550457705582192
        );
    }
);


// ************************************************************************* //
